app/views/loans/index.html.erb

            <%end%>
            <td><%= loan.user.firstname %></td>
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1