app/views/loans/new.html.erb

   <%= f.label :user_id %><br>
    <% user_array = User.all.map { |user| [user.firstname, user.id] } %>
---
SELECT `users`.* FROM `users`

   <%= f.label :book_id %><br>
   <% book_array = Book.all.map { |book| [book.title, book.id] } %>
---
SELECT `books`.* FROM `books`