app/views/loans/show.html.erb

  <strong>User:</strong>
  <%= @loan.user.firstname %>
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1


 <% b = Book.find_by(@loan.book.id)%>
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1