app/controllers/books_controller.rb

  def index
    @books = Book.all
---
SELECT `books`.* FROM `books`

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "ISBN", "description", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", ""], ["ISBN", ""], ["description", ""], ["author", ""], ["created_at", "2016-05-05 13:32:11.645740"], ["updated_at", "2016-05-05 13:32:11.645740"]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "status" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["status", "unavailable"], ["updated_at", "2016-05-05 13:41:23.375460"], ["id", 4]]