app/controllers/loans_controller.rb

SELECT `loans`.* FROM `loans`
---
  def index
    @loans = Loan.all

INSERT INTO `loans` (`user_id`, `book_id`, `start`, `end`, `created_at`, `updated_at`) VALUES (1, 1, '2016-05-05 20:32:00.000000', '2016-05-05 20:32:00.000000', '2016-05-05 20:33:00', '2016-05-05 20:33:00')
---
  def create
    @loan = Loan.new(loan_params)

    respond_to do |format|
      if @loan.save

DELETE FROM `loans` WHERE `loans`.`id` = 1
---
  def destroy
    @loan.destroy

SELECT  `loans`.* FROM `loans` WHERE `loans`.`id` = 5 LIMIT 1
---
    def set_loan
      @loan = Loan.find(params[:id])