app/controllers/users_controller.rb

INSERT INTO `users` (`username`, `firstname`, `lastname`, `email`, `adress1`, `adress2`, `phone_number`, `isActive`, `isAdmin`, `password_salt`, `password_hash`, `created_at`, `updated_at`) VALUES ('Dienys', 'Sev', 'Roy', 'sev@gmail.com', 'dub', 'par', '4874654654', 1, 1, '$2a$10$/IPGjVop1ornb7nP2cEB6O', '$2a$10$/IPGjVop1ornb7nP2cEB6OtsaspFzeZgdKJekat12ImnEmxZVg4r6', '2016-05-05 20:32:20', '2016-05-05 20:32:20')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "password_salt" = ?, "password_hash" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_salt", "$2a$10$GFrFBEC7Cyc9LWlUJFoo8e"], ["password_hash", "$2a$10$GFrFBEC7Cyc9LWlUJFoo8eEXMZu45udkXMtYFGJFuPcLTnFNRIm7K"], ["updated_at", "2016-05-05 12:52:01.575375"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)